tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
uint8_t IrrigationApp::pendingLearnedZoneId() const {
    return pendingLearnedZoneId_;
}

uint32_t IrrigationApp::pendingLearnedBaselinePulseRateX10000() const {
    return pendingLearnedBaselinePulseRateX10000_;
}

uint32_t IrrigationApp::pendingLearnedFlowMlPerMinute() const {
    const IrrigationConfig* current = configStore_.current();
    uint32_t flowMlPerMinute = 0;
    if (current) {
        FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
            pendingLearnedBaselinePulseRateX10000_,
            current->flowMeter.pulsesPerLiterX100,
            flowMlPerMinute);
    }
    return flowMlPerMinute;
}

bool IrrigationApp::clearLearnedZoneFlow(uint8_t zoneId,
                                         uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.status().active || !current ||
        pendingLearnedZoneId_ != 0 ||
        !BoardPins::isValidZoneId(zoneId) ||
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 == 0) {
        return false;
    }
    IrrigationConfig next = *current;
    uint32_t previousFlowMlPerMinute = 0;
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000,
        current->flowMeter.pulsesPerLiterX100,
        previousFlowMlPerMinute);
    next.zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 = 0;
    if (!configStore_.save(next, expectedConfigRevision)) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    events_.recordZoneFlowSaved(zoneId, previousFlowMlPerMinute, 0);
    return true;
}

void IrrigationApp::discardLearnedZoneFlow() {
    if (!wateringController_.status().active) {
        pendingLearnedZoneId_ = 0;
        pendingLearnedBaselinePulseRateX10000_ = 0;
    }
}

const IrrigationConfig* IrrigationApp::configuration() const {
    return configStore_.current();
}

IrrigationConfigStore::LoadResult IrrigationApp::configurationLoadResult() const {
    return configStore_.loadResult();
}

bool IrrigationApp::saveConfiguration(const IrrigationConfig& proposed,
                                      uint32_t expectedRevision,
                                      IrrigationEvents::ConfigurationChange change,
                                      uint8_t objectId) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || !current) {
        return false;
    }
    BoardHardware& hardware = BoardHardware::instance();
    const bool active = wateringController_.status().active;
    const bool frequencyChanged = proposed.valveDrive.pwmFrequencyHz !=
                                  current->valveDrive.pwmFrequencyHz;
    bool hardwareChanged = false;
    if (frequencyChanged && !active) {
        if (!hardware.configureValvePwmFrequency(proposed.valveDrive.pwmFrequencyHz)) {
            return false;
        }
        hardwareChanged = true;
    }
    const uint32_t previousFrequency = current->valveDrive.pwmFrequencyHz;
    if (!configStore_.save(proposed, expectedRevision)) {
        if (hardwareChanged && !hardware.configureValvePwmFrequency(previousFrequency)) {
            businessReady_ = false;
            hardware.safeShutdown();
        }
        return false;
    }
    pendingPwmReconfigure_ = frequencyChanged && active;
    wateringScheduler_.rebaseTimeCheck();
    if (!active) {
        resetUnexpectedFlowMonitor(millis());
    }
    events_.recordConfigurationChanged(change, objectId);
    return true;
}

const char* IrrigationApp::configurationError() const {
    return configStore_.lastError();
}

void IrrigationApp::advanceBusiness() {
    if (!businessReady_) {
        BoardHardware::instance().safeShutdown();
        return;
    }
    const uint32_t nowMs = millis();
    if (!eventConditionsInitialized_) {
        events_.syncStorageStatus();
        refreshRtcCondition(nowMs, true);
        eventConditionsInitialized_ = true;
    }
    refreshRtcCondition(nowMs, false);
    wateringController_.handle(nowMs);
    reportNewFlowDeviationEvents();
    consumeFinishedWatering(nowMs);
    const IrrigationConfig* config = configStore_.current();
    if (config && !wateringController_.status().active) {
        unexpectedFlowMonitor_.observe(nowMs, BoardHardware::instance().flowPulseCount());
    }
    if (config) {
        const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
        if (wateringScheduler_.storageReady()) {
            wateringScheduler_.handle(*config,
                                      now.synced,
                                      now.source == Esp32BaseTime::SOURCE_NTP,
                                      now.epochSec);
        }
        observeEventConditions(nowMs, now);
        Esp32BaseRecordStore::StoreStatus recordStatus{};
        Esp32BaseAppEvents::AppEventsStatus eventStatus{};
        if (wateringRecordStore_.readStatus(recordStatus) &&
            Esp32BaseAppEvents::readStatus(eventStatus)) {
            const uint64_t activitySequence =
                (static_cast<uint64_t>(recordStatus.nextRecordId) << 32U) |
                eventStatus.eventStore.nextRecordId;
            aliveCheckpoint_.handle(now,
                                    config->timeSafety.aliveCheckpointHours,
                                    wateringController_.status().active,
                                    activitySequence);
        }
    }
}

void IrrigationApp::reportNewFlowDeviationEvents() {
    const WateringStatus status = wateringController_.status();
    if (status.purpose != WateringPurpose::Normal) return;
    for (uint8_t index = 0; index < status.stepCount &&
                            index < status.zones.size(); ++index) {
        const ZoneWateringSummary& zone = status.zones[index];
        if (!BoardPins::isValidZoneId(zone.zoneId)) continue;
        const uint8_t zoneIndex = BoardPins::zoneIndex(zone.zoneId);
        PendingFlowDeviationEvent& low = pendingLowFlowEvents_[zoneIndex];
        if (zone.lowFlowActive && !low.pending) {
            low.detectedFlowMlPerMinute = zone.lowFlowDetectedMlPerMinute;
            low.baselineFlowMlPerMinute = zone.baselineFlowMlPerMinute;
            low.pending = true;
        }
        PendingFlowDeviationEvent& high = pendingHighFlowEvents_[zoneIndex];
        if (zone.highFlowActive && !high.pending) {
            high.detectedFlowMlPerMinute = zone.highFlowDetectedMlPerMinute;
            high.baselineFlowMlPerMinute = zone.baselineFlowMlPerMinute;
            high.pending = true;
        }
    }
    if (status.active) {
        return;
    }
    for (uint8_t zoneIndex = 0; zoneIndex < BoardPins::kZoneCount; ++zoneIndex) {
        const uint8_t zoneId = static_cast<uint8_t>(zoneIndex + 1U);
        PendingFlowDeviationEvent& low = pendingLowFlowEvents_[zoneIndex];
        if (low.pending) {
            ZoneWateringSummary zone{};
            zone.zoneId = zoneId;
            zone.lowFlowDetectedMlPerMinute = low.detectedFlowMlPerMinute;
            zone.baselineFlowMlPerMinute = low.baselineFlowMlPerMinute;
            events_.recordFlowDeviationEvent(
                zone,
                IrrigationEvents::ReasonCode::LowFlow,
                status.lastStopReason == WateringStopReason::LowFlow,
                status.source,
                status.planId);
            low = {};
        }
        PendingFlowDeviationEvent& high = pendingHighFlowEvents_[zoneIndex];
        if (high.pending) {
            ZoneWateringSummary zone{};
            zone.zoneId = zoneId;
            zone.highFlowDetectedMlPerMinute = high.detectedFlowMlPerMinute;
            zone.baselineFlowMlPerMinute = high.baselineFlowMlPerMinute;
            events_.recordFlowDeviationEvent(
                zone,
                IrrigationEvents::ReasonCode::HighFlow,
                status.lastStopReason == WateringStopReason::HighFlow,
                status.source,
                status.planId);
            high = {};
        }
    }
}

void IrrigationApp::consumeFinishedWatering(uint32_t nowMs) {
    const WateringSessionSummary* summary = wateringController_.finishedSession();
    if (!summary) {
        return;
    }

    if (summary->purpose == WateringPurpose::FlowCalibration) {
        flowCalibrationService_.captureFinishedSession(*summary, trustedEpoch());
    } else if (summary->purpose == WateringPurpose::ZoneFlowLearning &&
               summary->zoneCount == 1 &&
               summary->zones[0].suggestedBaselinePulseRateX10000 != 0) {
        pendingLearnedZoneId_ = summary->zones[0].zoneId;
        pendingLearnedBaselinePulseRateX10000_ =
            summary->zones[0].suggestedBaselinePulseRateX10000;
    }

    if (summary->purpose == WateringPurpose::Normal) {
        if (!wateringStartTimeValid_ ||
            !wateringRecordStore_.appendCompleted(wateringStartTime_, *summary)) {
            recordStorageFault_ = true;
            events_.recordWateringRecordSaveFailed(
                wateringStartTimeValid_ ? IrrigationEvents::ReasonCode::RecordAppendFailed
                                        : IrrigationEvents::ReasonCode::RecordStartTimeUnavailable,
                wateringRecordStore_.state(),
                wateringRecordStore_.lastError());
        } else {
            recordStorageFault_ = wateringRecordStore_.state() !=
                                  Esp32BaseRecordStore::StoreState::Ready;
        }
    }

    events_.recordAbnormalWateringStop(*summary);
    resetUnexpectedFlowMonitor(nowMs);
    applyPendingHardwareConfiguration();
    wateringController_.clearFinishedSession();
    wateringStartTime_ = {};
    wateringStartTimeValid_ = false;
}

uint32_t IrrigationApp::trustedEpoch() const {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return now.synced ? now.epochSec : 0;
}

void IrrigationApp::applyPendingHardwareConfiguration() {
    if (!pendingPwmReconfigure_ || wateringController_.status().active) {
        return;
    }
    const IrrigationConfig* config = configStore_.current();
    if (!config || !BoardHardware::instance().configureValvePwmFrequency(
                       config->valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    pendingPwmReconfigure_ = false;
}

void IrrigationApp::updateStatusIndicator(uint32_t nowMs) {
    StatusIndicator::Mode mode = StatusIndicator::Mode::ReadyIdle;
    if (!businessReady_ || recordStorageFault_ || eventStorageFault() ||
        schedulerStorageFault_ || checkpointStorageFault() || unexpectedFlowAlarm()) {
        mode = StatusIndicator::Mode::Critical;
    } else if (wateringController_.status().active) {
        mode = StatusIndicator::Mode::Active;
    }
    statusIndicator_.setMode(mode, nowMs);
    statusIndicator_.handle(nowMs);
}

void IrrigationApp::parameterConfigSaved(void* user) {
    if (user) static_cast<IrrigationApp*>(user)->handleParameterConfigSaved();
}

bool IrrigationApp::applyStoredParameterConfig() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return false;
    parameterConfigScratch_ = *current;
    return IrrigationParameterConfig::applyStored(parameterConfigScratch_) &&
           configStore_.applyRuntimeParameters(parameterConfigScratch_);
}

bool IrrigationApp::validateParameterConfig(const IrrigationConfig& proposed,
                                            char* error,
                                            size_t errorLength,
                                            void* user) {
    const auto* app = static_cast<IrrigationApp*>(user);
    const IrrigationConfig* current = app ? app->configStore_.current() : nullptr;
    if (!current) return true;
    for (const WateringPlan& plan : current->plans) {
        if (!plan.configured) continue;
        for (uint8_t zoneIndex = 0; zoneIndex < plan.zoneDurationMinutes.size(); ++zoneIndex) {
            if (plan.zoneDurationMinutes[zoneIndex] >
                proposed.runLimits.maximumZoneDurationMinutes) {
                std::snprintf(error,
                              errorLength,
                              "计划“%s”的水路 %u 为 %u 分钟，请先调整计划。",
                              plan.name.data(),
                              static_cast<unsigned>(zoneIndex + 1U),
                              static_cast<unsigned>(plan.zoneDurationMinutes[zoneIndex]));
                return false;
            }
        }
    }
    return true;
}

void IrrigationApp::handleParameterConfigSaved() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return;
    parameterConfigScratch_ = *current;
    if (!IrrigationParameterConfig::applyStored(parameterConfigScratch_)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    const bool frequencyChanged = parameterConfigScratch_.valveDrive.pwmFrequencyHz !=
                                  current->valveDrive.pwmFrequencyHz;
    const bool active = wateringController_.status().active;
    if (frequencyChanged && !active &&
        !BoardHardware::instance().configureValvePwmFrequency(
            parameterConfigScratch_.valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    if (!configStore_.applyRuntimeParameters(parameterConfigScratch_)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    pendingPwmReconfigure_ = frequencyChanged && active;
    wateringScheduler_.rebaseTimeCheck();
    if (!active) resetUnexpectedFlowMonitor(millis());
    events_.recordConfigurationChanged(
        IrrigationEvents::ConfigurationChange::SystemParametersUpdated);
}

void IrrigationApp::resetUnexpectedFlowMonitor(uint32_t nowMs) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return;
    }
    unexpectedFlowMonitor_.begin(
        nowMs,
        BoardHardware::instance().flowPulseCount(),
        config->flowProtection.unexpectedFlowDelaySec,
        config->flowProtection.unexpectedFlowWindowSec,
        config->flowProtection.unexpectedFlowPulseCount);
    events_.observeClosedValveFlow(Esp32BaseAppEvents::ObservedConditionState::Unknown,
                                   0,
                                   config->flowProtection.unexpectedFlowWindowSec,
                                   config->flowProtection.unexpectedFlowPulseCount);
}

